{
  "architectures": [
    "Cosmos3OmniModel"
  ],
  "auto_map": {
    "AutoConfig": "cosmos3.model.Cosmos3OmniConfig",
    "AutoModel": "cosmos3.model.Cosmos3OmniModel"
  },
  "dtype": "bfloat16",
  "model": {
    "_recursive_": false,
    "_target": "omni_mot_model",
    "config": {
      "action_gen": true,
      "activation_checkpointing": {
        "determinism_check": "default",
        "mode": "full",
        "preserve_rng_state": true,
        "save_ops_regex": [
          "fmha"
        ]
      },
      "causal_training_strategy": "none",
      "compile": {
        "compile_dynamic": true,
        "compiled_region": "language",
        "coordinate_descent_tuning": false,
        "enabled": true,
        "max_autotune_pointwise": false,
        "use_cuda_graphs": false
      },
      "diffusion_expert_config": {
        "base_fps": 24,
        "enable_fps_modulation": true,
        "load_weights_from_pretrained": true,
        "max_vae_latent_side_after_patchify": 20,
        "patch_spatial": 2,
        "position_embedding_type": "unified_3d_mrope",
        "rope_h_extrapolation_ratio": 1.0,
        "rope_t_extrapolation_ratio": 1.0,
        "rope_w_extrapolation_ratio": 1.0,
        "sound_base_temporal_compression_factor": null,
        "timestep_range": 1.0,
        "unified_3d_mrope_reset_spatial_ids": true,
        "unified_3d_mrope_temporal_modality_margin": 15000,
        "vision_temporal_position_mode": "latent_index"
      },
      "ema": {
        "enabled": false,
        "iteration_shift": 0,
        "rate": 0.1
      },
      "exclude_reasoner_weights_from_checkpoint": false,
      "fixed_step_sampler_config": null,
      "input_caption_key": "ai_caption",
      "input_image_key": "images",
      "input_video_key": "video",
      "joint_attn_implementation": "two_way",
      "latent_downsample_factor": 16,
      "lbl": {
        "coeff_gen": null,
        "coeff_und": null,
        "method": "local"
      },
      "log_enc_time_every_n": 100,
      "lora_alpha": 32,
      "lora_enabled": false,
      "lora_rank": 16,
      "lora_target_modules": "q_proj_moe_gen,k_proj_moe_gen,v_proj_moe_gen,o_proj_moe_gen",
      "max_action_dim": 64,
      "max_num_tokens_after_packing": -1,
      "natten_parameter_list": null,
      "net": null,
      "num_embodiment_domains": 32,
      "parallelism": {
        "attention_io_layout": "sequence_sharded",
        "cfg_parallel_shard_degree": 1,
        "context_parallel_shard_degree": 1,
        "data_parallel_replicate_degree": 1,
        "data_parallel_shard_degree": 4,
        "enable_inference_mode": false,
        "fsdp_master_dtype": "float32"
      },
      "precision": "bfloat16",
      "rectified_flow_inference_config": {
        "num_train_timesteps": 1000,
        "scheduler_type": "unipc",
        "shift": 1,
        "use_dynamic_shifting": false
      },
      "rectified_flow_training_config": {
        "action_loss_weight": 10.0,
        "image_loss_scale": 1.0,
        "independent_action_schedule": false,
        "independent_sound_schedule": false,
        "loss_scale": 10.0,
        "normalize_loss_by_active": false,
        "shift": {
          "256": 3,
          "480": 5,
          "720": 10
        },
        "shift_action": null,
        "shift_sound": null,
        "sound_loss_scale": null,
        "train_time_action_distribution": "logitnormal",
        "train_time_image_distribution": "logitnormal",
        "train_time_sound_distribution": "logitnormal",
        "train_time_video_distribution": "waver",
        "train_time_weight": "uniform",
        "use_discrete_rf": false,
        "use_dynamic_shift": false
      },
      "resolution": "720",
      "sound_dim": null,
      "sound_gen": false,
      "sound_latent_fps": 25,
      "sound_tokenizer": null,
      "state_ch": 48,
      "state_t": 300,
      "tokenizer": {
        "_target": "wan2pt2_vae_interface",
        "bucket_name": "",
        "causal": true,
        "chunk_duration": 93,
        "encode_bucket_multiple": null,
        "encode_chunk_frames": {
          "256": 68,
          "480": 24,
          "720": 12
        },
        "encode_exact_durations": [
          33
        ],
        "keep_decoder_cache": false,
        "object_store_credential_path_pretrained": "",
        "spatial_compression_factor": 16,
        "temporal_compression_factor": 4,
        "temporal_window": null,
        "use_streaming_encode": false,
        "vae_path": "../../checkpoints/Wan-AI/Wan2.2-TI2V-5B/Wan2.2_VAE.pth"
      },
      "video_temporal_causal": false,
      "vision_gen": true,
      "vlm_config": {
        "layer_module": "Qwen2MoTDecoderLayer",
        "model_instance": {
          "_target": "qwen3_vl_text_for_causal_lm",
          "config": {
            "_target": "create_vlm_config",
            "base_config": {
              "_target": "qwen3_vl_mot_config_from_json_file",
              "json_file": "cosmos3://vfm/models/vlm/qwen3_vl/configs/Qwen3-VL-8B-Instruct.json"
            },
            "freeze_und": false,
            "layer_module": "MoTDecoderLayer",
            "qk_norm_for_text": true,
            "tie_word_embeddings": true
          }
        },
        "model_name": "Qwen/Qwen3-VL-8B-Instruct",
        "pretrained_weights": {
          "backbone_path": "s3://bucket0/cosmos3/pretrained/huggingface/Qwen/Qwen3-VL-8B-Instruct/",
          "checkpoint_format": null,
          "credentials_path": "",
          "enable_gcs_patch_in_boto3": true,
          "enabled": false
        },
        "qk_norm": false,
        "safetensors_path": "",
        "tie_word_embeddings": false,
        "tokenizer": {
          "_target": "create_qwen2_tokenizer_with_download",
          "config_variant": "hf",
          "pretrained_model_name": "Qwen/Qwen3-VL-8B-Instruct"
        },
        "use_system_prompt": false
      }
    }
  },
  "model_type": "cosmos3_omni",
  "transformers_version": "4.57.6"
}
